Revit 2027 API
TextRange Constructor
Overload List
Name | Description
TextRange() |  Constructs a TextRange with default values for start and length.
TextRange(TextRange) |  Constructs a copy of the input TextRange object.
TextRange(Int32, Int32) |  Constructs a TextRange with input start and length.
Top
See Also
Reference
TextRange Class
Autodesk.Revit.DB Namespace